#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Представление = СформироватьПредставление(Данные.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеКонтактногоЛица(КонтактноеЛицо)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛица.Наименование КАК Наименование,
		|	КонтактныеЛица.ДействуетНаОсновании КАК ДействуетНаОсновании
		|ИЗ
		|	Справочник.КЮ_КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Ссылка = &КонтактноеЛицо";

	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("ДействуетНаОсновании", "");

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция СформироватьПредставление(КонтактноеЛицо)

	Данные = ДанныеКонтактногоЛица(КонтактноеЛицо);

	Результат = Данные.Наименование;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Результат = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДействуетНаОсновании);
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
