#Область ПрограммныйИнтерфейс

// Добавляет на форму поле выбора контактного лица контрагента.
// Объект владелец формы должен содержать реквизит КЮ_КонтактноеЛицо.
// 
// Параметры:
//  Форма - Форма - Форма, на которую добавляется поле выбора.
//
//  Родитель - ГруппаФормы,
//             ТаблицаФормы,
//             ФормаКлиентскогоПриложения - Родитель для добавляемого элемента. Необязательный.
//                                          Если не указан, то вставляется на верхний уровень.
//  Элемент - ДекорацияФормы,
//            ГруппаФормы,
//            КнопкаФормы,
//            ТаблицаФормы,
//            ПолеФормы - Элемент, перед которым должен быть вставлен новый элемент.
//                        Необязательный. Если не указан, то элемент будет вставлен в конец.
//
// Пример:
//  КЮ_КонтактныеЛицаСервер.ДобавитьПолеВыбора(ЭтотОбъект, Элементы.ГруппаШапкаПраво);
//
Процедура ДобавитьПолеВыбора(Форма, Родитель = Неопределено, Элемент = Неопределено) Экспорт

	ПолеКонтактноеЛицо = Форма.Элементы.Вставить("КЮ_КонтактноеЛицо", Тип("ПолеФормы"), Родитель, Элемент);
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактноеЛицо.Заголовок = "Контактное лицо";
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.КЮ_КонтактноеЛицо";

КонецПроцедуры

#КонецОбласти
